{
  "courses": [
    {
      "id": 1,
      "title": "Guitar Fundamentals",
      "slug": "guitar-fundamentals",
      "description": "Learn the basics of playing guitar with our comprehensive beginner's course.",
      "price": 99.99,
      "instructor": "John Doe",
      "instructorimg": "/courses/guitar-instructor.jpg",
      "instructorBio": "John Doe is a seasoned guitarist with over 20 years of experience, specializing in teaching beginners the fundamentals of guitar playing. He has performed with various bands and is known for his patient and structured teaching methods.",
      "isFeatured": true,
      "image": "/courses/guitar.jpg"
    },
    {
      "id": 2,
      "title": "Piano for Beginners",
      "slug": "piano-for-beginners",
      "description": "Start your musical journey with foundational piano skills taught by expert instructors.",
      "price": 109.99,
      "instructor": "Jane Smith",
      "instructorimg": "/courses/piano-instructor.jpg",
      "instructorBio": "Jane Smith is an accomplished pianist with a decade of experience teaching piano to students of all ages. he focuses on building a strong foundation in music theory and technique.",
      "isFeatured": false,
      "image": "/courses/piano.jpg"
    },
    {
      "id": 3,
      "title": "Advanced Vocal Techniques",
      "slug": "advanced-vocal-techniques",
      "description": "Enhance your singing with advanced vocal techniques for intermediate to advanced learners.",
      "price": 119.99,
      "instructor": "Emily Johnson",
      "instructorimg": "/courses/vocalist-instructor.jpg",
      "instructorBio": "Emily Johnson is a professional vocalist with over 15 years of experience in classical, jazz, and contemporary styles. She is passionate about helping singers unlock their full vocal potential.",
      "isFeatured": true,
      "image": "/courses/vocalist.jpg"
    },
    {
      "id": 4,
      "title": "Drumming Mastery",
      "slug": "drumming-mastery",
      "description": "Master the drums with our comprehensive course covering all skill levels.",
      "price": 129.99,
      "instructor": "Mike Brown",
      "instructorimg": "/courses/drumming-instructor.jpg",
      "instructorBio": "Mike Brown has been a professional drummer for over 20 years, performing with bands across various genres. His drumming courses are designed for players of all skill levels, with a focus on technique and rhythm.",
      "isFeatured": false,
      "image": "/courses/drumming.jpg"
    },
    {
      "id": 5,
      "title": "Jazz Improvisation",
      "slug": "jazz-improvisation",
      "description": "Learn the art of jazz improvisation with this course designed for all levels.",
      "price": 139.99,
      "instructor": "Chris Davis",
      "instructorimg": "/courses/jazz-instructor.jpg",
      "instructorBio": "Chris Davis is a highly respected jazz musician known for his expertise in improvisation. He has performed at numerous jazz festivals worldwide and teaches students the key principles of jazz theory and improvisation.",
      "isFeatured": false,
      "image": "/courses/jazz.jpg"
    },
    {
      "id": 6,
      "title": "Music Production Fundamentals",
      "slug": "music-production-fundamentals",
      "description": "Dive into music production with this introductory course on the basics of sound engineering and mixing.",
      "price": 149.99,
      "instructor": "Alex Wilson",
      "instructorimg": "/courses/music-prod-instructor.jpg",
      "instructorBio": "Alex Wilson is a music producer with over 10 years of experience in sound engineering and music production. His course is designed to help aspiring producers understand the fundamentals of audio production and mixing.",
      "isFeatured": true,
      "image": "/courses/music-prod.jpg"
    },
    {
      "id": 7,
      "title": "Songwriting Essentials",
      "slug": "songwriting-essentials",
      "description": "Learn the essentials of songwriting to express your musical creativity.",
      "price": 159.99,
      "instructor": "Samantha Miller",
      "instructorimg": "/courses/song-writing-instructor.jpg",
      "instructorBio": "Samantha Miller is a professional songwriter and composer with a passion for helping students find their creative voice. She has written music for films, commercials, and various artists.",
      "isFeatured": false,
      "image": "/courses/song-writing.jpg"
    },
    {
      "id": 8,
      "title": "Electronic Music Production",
      "slug": "electronic-music-production",
      "description": "Create compelling electronic music with our course designed for beginners to advanced users.",
      "price": 169.99,
      "instructor": "Luke Harris",
      "instructorimg": "/courses/music-prod-instructor.jpg",
      "instructorBio": "Luke Harris is an electronic music producer who has been creating music for over a decade. His work spans multiple genres, and he has a knack for helping students develop their own unique electronic sound.",
      "isFeatured": true,
      "image": "/courses/music-prod.jpg"
    },
    {
      "id": 9,
      "title": "Classical Music History",
      "slug": "classical-music-history",
      "description": "Explore the rich history of classical music from its origins to the present day.",
      "price": 179.99,
      "instructor": "Grace Lee",
      "instructorimg": "/courses/classical-music-instructor.jpg",
      "instructorBio": "Grace Lee is a music historian with a focus on classical music. Her passion for teaching stems from her desire to share the beauty and complexity of classical music with others.",
      "isFeatured": false,
      "image": "/courses/classical-music.jpg"
    },
    {
      "id": 10,
      "title": "Blues Guitar Techniques",
      "slug": "blues-guitar-techniques",
      "description": "Discover the techniques of blues guitar to add soul and depth to your playing.",
      "price": 189.99,
      "instructor": "Ethan Moore",
      "instructorimg": "/courses/blues-instructor.jpg",
      "instructorBio": "Ethan Moore is a blues guitarist known for his expressive playing style. He has spent over 15 years performing and teaching blues guitar, and his courses are designed to help guitarists master the techniques that define the blues genre.",
      "isFeatured": true,
      "image": "/courses/blues.jpg"
    }
  ]
}
